<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>4.&nbsp;Answers 2</title><link rel="stylesheet" href="html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.67.0"><link rel="start" href="index.html" title="Operating Systems"><link rel="up" href="exercises.html" title="Chapter&nbsp;9.&nbsp;Exercises"><link rel="prev" href="exercises_answers_1.html" title="3.&nbsp;Answers 1"><link rel="next" href="individual_assignments.html" title="Chapter&nbsp;10.&nbsp;Individual Assignments - Laboratory"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">4.&nbsp;Answers 2</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="exercises_answers_1.html"><img src="images/prev.gif" alt="Prev"></a>&nbsp;</td><th width="60%" align="center">Chapter&nbsp;9.&nbsp;Exercises</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="individual_assignments.html"><img src="images/next.gif" alt="Next"></a></td></tr></table><hr></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="exercises_answers_2"></a>4.&nbsp;Answers 2</h2></div></div></div><div class="itemizedlist"><ul type="disc"><li><p><span class="bold"><strong>Answers 2</strong></span></p><div class="orderedlist"><ol type="1"><li><p>As aplica&ccedil;&otilde;es distribu&iacute;das tem como caracter&iacute;sticas: &middot; Presen&ccedil;a de pelo menos um cliente e um servidor &middot; Compartilhamento de recursos &middot; Transpar&ecirc;ncia de localiza&ccedil;&atilde;o &middot; Clientes e servidores independentes de plataforma de software e hardware</p></li><li><p>Um middleware &eacute; um software que executa entre a aplica&ccedil;&atilde;o cliente e servidora, ou seja, o middleware &eacute; um conjunto de APIs que s&atilde;o usadas para invocar um servi&ccedil;o, transmitir o pedido pela rede e devolver a resposta ao solicitante. O middleware n&atilde;o inclui o software que prov&ecirc; o servi&ccedil;o e nem bases de dados e nem interfaces de usu&aacute;rio. No middleware h&aacute; uma s&eacute;rie de servi&ccedil;os de comunica&ccedil;&atilde;o que n&atilde;o precisam ser reimplementados quando se desenvolve uma aplica&ccedil;&atilde;o cliente/ servidor, sendo que elas podem ser diretamente utilizadas para facilitar o processo de desenvolvimento.</p></li><li><p>Suportar v&aacute;rios clientes e v&aacute;rios servidores, gerenciar de forma eficiente os recursos, ser o mais transparente poss&iacute;vel, ser independente de plataforma, hardware e rede, ser escal&aacute;vel, e manter integridade entre as transa&ccedil;&otilde;es.</p></li><li><p>Servidores de arquivos: compartilhamento de arquivos entre clientes e servidores (cria&ccedil;&atilde;o de reposit&oacute;rios compartilhados) Servidores de base de dados: compartilhamento de dados entre os clientes, sendo que eles ficam armazenados no servidor e toda busca e atualiza&ccedil;&atilde;o dos dados &eacute; requisitada atrav&eacute;s de uma mensagem do cliente para o servidor e a opera&ccedil;&atilde;o &eacute; realizada no servidor. Servidores de transa&ccedil;&atilde;o: Servidores de groupware: troca de informa&ccedil;&otilde;es n&atilde;o estruturadas entre aplica&ccedil;&otilde;es distribu&iacute;das que gerenciam diferentes tipos de informa&ccedil;&atilde;o como textos, imagens, email, workflow... Os servidores de workflow oferecem os recursos para buscar, organizar, distribuir, alterar estas informa&ccedil;&otilde;es que s&atilde;o chamadas de documentos. Servidores de objetos distribu&iacute;dos: compartilhamento de objetos entre as aplica&ccedil;&otilde;es cliente e servidoras. Os objetos s&atilde;o usados nas aplica&ccedil;&otilde;es ora como clientes, ora como servidores, dependendo da sua utiliza&ccedil;&atilde;o. Servidores de aplica&ccedil;&atilde;o web: apresenta&ccedil;&atilde;o de documentos requisitados pelos clientes ???</p></li><li><p>&middot; A l&oacute;gica de neg&oacute;cio &eacute; encapsulada dentro do objeto</p><p>&middot; Instrospe&ccedil;&atilde;o permite descobrir facilmente o que tem dentro do objeto (ferramentas visuais)</p><p>&middot; Pode ser transportado pela rede</p><p>&middot; &Eacute; multiplataforma</p><p>&middot; Sistemas mais flex&iacute;veis em fun&ccedil;&atilde;o do encapsulamento</p><p>&middot; Permite reutiliza&ccedil;&atilde;o e agrupamento de objeto</p><p>&middot; controle centralizado de vers&otilde;es de objeto,</p><p>&middot; distribui&ccedil;&atilde;o de carga</p></li><li><p>Um objeto, seja cliente ou servidor, &eacute; definido em uma IDL, que &eacute; a linguagem padr&atilde;o entendida pelo ORB. Cada linguagem possui um engine respons&aacute;vel por gerar os stubs (cliente) e skeletons (implementa&ccedil;&atilde;o de objeto) correspondentes &agrave;quela linguagem a partir da IDL que foi definida. Uma vez gerados os stubs e skeletons, e depois que o objeto tiver sido implementado, um cliente faz uma requisi&ccedil;&atilde;o de um m&eacute;todo de um objeto que pode estar local ou remoto. O acesso ao objeto &eacute; feito via ORB.</p></li><li><p></p></li><li><p>Organizar (centralizar/agrupar) nomes de hosts (associados a endere&ccedil;os IPs) em uma hierarquia de dom&iacute;nios para permitir a localiza&ccedil;&atilde;o de servidores atrav&eacute;s da rede. Sem o DNS, n&atilde;o seria poss&iacute;vel identificar um servidor atrav&eacute;s de seu nome. Isso s&oacute; seria poss&iacute;vel atrav&eacute;s do n&uacute;mero IP do mesmo.</p></li><li><p>A aplica&ccedil;&atilde;o solicita o endere&ccedil;o IP de um servidor ao DNS local. Se este souber o ip, ele lhe devolve, sen&atilde;o, ele faz uma requisi&ccedil;&atilde;o ao servidor autoritativo do dom&iacute;nio. Esse pode conhecer o servidor procurado e devolver o endere&ccedil;o IP, ou fornecer o endere&ccedil;o de algu&eacute;m que o conhe&ccedil;a. Quando o endere&ccedil;o for localizado o DNS local o envia &agrave; aplica&ccedil;&atilde;o que o solicitou.</p></li><li><p>dom&iacute;nio: todas as m&aacute;quinas que est&atilde;o abaixo do servidor de DNS</p><p>Autoritativo para a zona: conhece os IPs de todas as m&aacute;quinas da zona para qual ele &eacute; autoritarivo</p></li><li><p>Vantagens:</p><p>&middot; Possibilidade de montar um sistema de arquivos via rede de maneira transparente como se fosse local.</p><p>&middot; Diret&oacute;rios podem ser montados no momento do boot</p><p>&middot; Dados ficam centralizados em um &uacute;nico host</p><p>O VFS &eacute; uma camada de abstracao de "alto-n&iacute;vel" onde sistemas de arquivos de diferentes tipos s&atilde;o montados sob uma mesma &aacute;rvore (ext3, reiser, iso9660, vfat, ntfs, hfs e qualquer outro suportado pelo kernel). NFS &eacute; montado transparentemente como se fosse um sistema de arquivos local, basta que ele implemente a API do VFS.</p></li><li><p>O NIS &eacute; uma base de dados que armazena informa&ccedil;&otilde;es compartilhadas dentro de uma rede local como usu&aacute;rios, senhas, hosts que fazem parte da rede, etc. O NIS faz com que a rede seja vista como um sistema &uacute;nico onde todas as contas de usu&aacute;rio s&atilde;o as mesmas em todos os hosts, mant&eacute;m a sincroniza&ccedil;&atilde;o das informa&ccedil;&otilde;es compartilhadas entre os hosts e prov&ecirc; transpar&ecirc;ncia da rede para os usu&aacute;rios.</p></li><li><p>A rela&ccedil;&atilde;o &eacute; que ambos s&atilde;o servi&ccedil;os de um sistema operacional de rede, mas o NIS cont&eacute;m informa&ccedil;&otilde;es relacionadas &agrave; configura&ccedil;&atilde;o do sistema da rede local, enquanto o DNS cont&eacute;m informa&ccedil;&otilde;es sobre uma hierarquia de hosts (e IPS). A filosofia de uso de cada um &eacute; diferente.</p></li><li><p>N&atilde;o. Os dom&iacute;nios NIS exportam uma cole&ccedil;&atilde;o de informa&ccedil;&otilde;es de configura&ccedil;&atilde;o do sistema para um conjunto de m&aacute;quinas. Eles t&ecirc;m fun&ccedil;&atilde;o puramente administrativa, n&atilde;o s&atilde;o organizados hierarquicamente, n&atilde;o s&atilde;o compartilhados e n&atilde;o podem ser vistos por usu&aacute;rios que n&atilde;o perten&ccedil;am ao dom&iacute;nio.</p></li><li><p>Porque n&atilde;o &eacute; poss&iacute;vel encontrar um sistema operacional de rede para ser comprado como um pacote fechado, como acontece com os sistemas operacionais comuns. O NOS &eacute; um conjunto de servi&ccedil;os que formam um sistema operacional mais complexo que pode ser executado em sistemas distribu&iacute;dos.</p></li><li><p>&Eacute; implementado atrav&eacute;s de chamadas RPC o que o torna stateless (n&atilde;o mant&eacute;m estados entre as requisi&ccedil;&otilde;es. Vantagem: menos overhead de comunica&ccedil;&atilde;o (UDP), e resolve problemas de sincroniza&ccedil;&atilde;o (p/. ex. caso um cliente ou servidor tenha problemas).</p></li><li><p>O cliente NIS faz uma chamada a um procedimento, por exemplo para listar um diret&oacute;rio. Para o cliente NIS, esse procedimento est&aacute; local, mas a requisi&ccedil;&atilde;o &eacute; passada para o servidor NIS que executa o pedido e devolve a resposta ao cliente.</p></li><li><p>Os servidores de dom&iacute;nio precisam teoricamente consultar o .com para resolver um dom&iacute;nio .com que n&atilde;o esteja cacheado ou n&atilde;o seja conhecido de outra forma. Para isto precisam recorrer algumas vezes ao servidor autoritativo .com e para tal, precisam encontr&aacute;-lo como uma entrada no DNS. Se esta entrada for alterada, &eacute; necess&aacute;rio que ela seja atualizada (automaticamnente ou n&atilde;o) nos servidores de DNS locais. N&atilde;o &eacute; usual, mas o ".com" e o "." mudam de IP em caso excepcionais como aconteceu m&ecirc;s passado quando houve um ataque de DOS (denial of service) na rede onde fica o servidor prim&aacute;rio de DNS do "." (lembrar que para todo e qualquer dom&iacute;nio h&aacute; pelo menos um servidor prim&aacute;rio e um secund&aacute;rio).</p></li></ol></div></li></ul></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="exercises_answers_1.html"><img src="images/prev.gif" alt="Prev"></a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="exercises.html"><img src="images/up.gif" alt="Up"></a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="individual_assignments.html"><img src="images/next.gif" alt="Next"></a></td></tr><tr><td width="40%" align="left" valign="top">3.&nbsp;Answers 1&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html"><img src="images/home.gif" alt="Home"></a></td><td width="40%" align="right" valign="top">&nbsp;Chapter&nbsp;10.&nbsp;Individual Assignments - Laboratory</td></tr></table></div></body></html>