<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>4.&nbsp;Power Supply SME 59</title><link rel="stylesheet" href="html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.67.0"><link rel="start" href="index.html" title="Introduction to Electricity for Computing"><link rel="up" href="extra.html" title="Chapter&nbsp;4.&nbsp;Extra Material"><link rel="prev" href="extra_generator_tr-0463.html" title="3.&nbsp;Function Generator TR-0463"><link rel="next" href="extra_resistors.html" title="5.&nbsp;Reading Resistors"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">4.&nbsp;Power Supply SME 59</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="extra_generator_tr-0463.html"><img src="images/prev.gif" alt="Prev"></a>&nbsp;</td><th width="60%" align="center">Chapter&nbsp;4.&nbsp;Extra Material</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="extra_resistors.html"><img src="images/next.gif" alt="Next"></a></td></tr></table><hr></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="extra_power_supply"></a>4.&nbsp;Power Supply SME 59</h2></div></div></div><p>Este aparelho apresenta os seguintes elementos:</p><div class="itemizedlist"><ul type="disc"><li><p>Fonte de tens&atilde;o cont&iacute;nua: 1 fonte sim&eacute;trica +/- 20V ou 2 fontes de 0 a 2 A.</p></li><li><p>Fonte de corrente cont&iacute;nua: 0 - 2A.</p></li><li><p>Mult&iacute;metro de 3 1/2 digitos em 3 escalas:(2V, 20V e 200V).</p></li><li><p>Amper&iacute;metro de 3 1/2 dig. em 3 escalas:(2mA, 20mA, 200mA).</p></li></ul></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e1167"></a>4.1.&nbsp;Identifica&ccedil;&atilde;o dos controles</h3></div></div></div><div class="figure"><a name="d0e1170"></a><p class="title"><b>Figure&nbsp;4.7.&nbsp;Fonte de Alimenta&ccedil;&atilde;o</b></p><div class="mediaobject"><img src="resources/anexo7.jpg" alt="Fonte de Alimenta&ccedil;&atilde;o"></div></div><p>1. LED indicador de opera&ccedil;&atilde;o no modo de tens&atilde;o-constante para a fonte mestra.</p><p>2. Medidor digital de 3 1/2 d&iacute;gitos da fonte mestra, utilizado tamb&eacute;m para medi&ccedil;&otilde;es externas.</p><p>3. LED indicador de opera&ccedil;&atilde;o no modo de corrente-constante da fonte mestra.</p><p>4. Chave INT/EXT. utilizada para comutar a opera&ccedil;&atilde;o do medidor de fonte - mestra para medi&ccedil;&otilde;es internas ou externas, sendo que neste ultimo caso o medidor permanece totalmente isolado galvanicamente das fontes.</p><p>5. Chave V/A. comuta a fun&ccedil;&atilde;o do medidor da fonte mestra de volt&iacute;metro para amper&iacute;metro e vice versa, tanto no modo interno com externo.</p><p>6. Teclas de mudan&ccedil;a de escala do medidor da fonte mestra. Permitem 3 escalas de tens&atilde;o nos modos interno ou externo e tr&ecirc;s escalas de corrente somente no modo externo (no modo interno esta dispon&iacute;vel somente uma escala).</p><p>7. Bornes de Entrada para medi&ccedil;&otilde;es externas.</p><p>8. LED piloto.</p><p>9. Interruptor geral da Fonte.</p><p>10. Controle de corrente de fonte mestra, ajusta o limite de corrente no modo de Tens&atilde;o-Constante ou a corrente no modo de Corrente-Constante.</p><p>11. Bornes de sa&iacute;da, positivo e negativo respectivamente da fonte mestra.</p><p>12. Controle de Tens&atilde;o, ajusta a tens&atilde;o de sa&iacute;da da fonte mestra no modo de Tens&atilde;o-Constante ou o 'teto' de tens&atilde;o no modo de Corrente-Constante.</p><p>13. Borne de Aterramento, ligado galvanicamente a caixa de fonte.</p><p>14. Idem 11 somente que para a fonte escrava.</p><p>15. Controle de corrente de fonte escrava. ajusta o limite de corrente no modo de Tens&atilde;o-Constante ou a corrente no modo de Corrente-Constante.</p><p>16. Controle de Tens&atilde;o, ajusta a tens&atilde;o de sa&iacute;da da fonte escrava no modo de Tens&atilde;o-Constante ou o 'teto' de tens&atilde;o no modo de Corrente-Constante. N&atilde;o tem atua&ccedil;&atilde;o quando a chave INDEP./SIMET estiver na posi&ccedil;&atilde;o SIMET.</p><p>17. LED indicador de opera&ccedil;&atilde;o no modo de tens&atilde;o-constante para a fonte escrava.</p><p>18. LED indicador de opera&ccedil;&atilde;o. no modo de corrente-constante para a fonte escrava.</p><p>19. Chave INDEP./SIMET., quando na posi&ccedil;&atilde;o INDEP permite a opera&ccedil;&atilde;o independente das duas fontes, estando as mesmas isoladas galvanicamente. Na posi&ccedil;&atilde;o SIMET, efetuando as liga&ccedil;&otilde;es conforme indicado na fig. 2. a tens&atilde;o da fonte escrava ser&aacute; igual a da fonte mestra, operando as duas em sim&eacute;trica.</p><p>20. Medidor digital de 3 1/2 d&iacute;gitos usado para medidas internas na fonte escrava.</p><p>21. Chave ALTO/BAIXO do medidor digital. atua somente na fun&ccedil;&atilde;o de volt&iacute;metro fazendo-o operar nas seguintes escalas: BAIXO: 0 A 19,99V ALTO: 0 A 199.9V</p><p>22. Chave V/A, comuta a fun&ccedil;&atilde;o do medidor digital para as fun&ccedil;&otilde;es V (volt&iacute;metro).</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e1220"></a>4.2.&nbsp;Modo de opera&ccedil;&atilde;o</h3></div></div></div><p><span class="bold"><strong>1 - OPERANDO COM FONTE INDEPENDENTE</strong></span></p><p>O ajuste da tens&atilde;o de sa&iacute;da poder&aacute; ser feito com ou sem carga aplicada, para tanto, coloque a chave 5 da fonte mestra ou 22 da fonte escrava na posi&ccedil;&atilde;o V, os controles de corrente 10 ou 15 no m&aacute;ximo, a chave 6 &agrave; posi&ccedil;&atilde;o 200 V ou a chave 21 na posi&ccedil;&atilde;o ALTO, em seguida, variando o ajuste de tens&atilde;o la ou 16 determine a tens&atilde;o desejada. Caso a tens&atilde;o seja inferior a 20 V, utilize o volt&iacute;metro na posi&ccedil;&atilde;o 20V na fonte mestra ou BAIXO na fonte escrava para obter uma leitura com maior precis&atilde;o.</p><p>Em seguida, ajuste o limite de corrente da seguinte forma: coloque a chave 5 ou 22 na posi&ccedil;&atilde;o A ( nesta condi&ccedil;&atilde;o a posi&ccedil;&atilde;o de 6 ou 21 &eacute; indiferente, pois h&aacute; somente uma escala de corrente para os medidores para medidas internas a fonte) e ajuste os controles de corrente 10 ou 15 no m&iacute;nimo. Curto-circuite os bornes de sa&iacute;da da 11 ou 14 com um fio que possa suportar a corrente a ser determinada. Agindo agora sobre o controle de corrente 10 ou 15 procure obter no medidor o valor da corrente que estabeleceu como limite.</p><p>OBS.: no modo de Corrente-Constante o LED Icte ficar&aacute; aceso.</p><p><span class="bold"><strong>2 - OPERANDO COMO FONTE SIM&Eacute;TRICA</strong></span></p><p>Para operar como fonte sim&eacute;trica fa&ccedil;a a interliga&ccedil;&atilde;o dos bornes conforme fig. 19 e coloque a chave INDEP/SIMET na posi&ccedil;&atilde;o SIMET. O ajuste da tens&atilde;o dever&aacute; ser feito atrav&eacute;s do controle da fonte mestra 12. Para o ajuste da corrente proceda conforme o par&aacute;grafo 1 com uma &uacute;nica diferen&ccedil;a o controle de corrente da fonte escrava dever&aacute; estar no m&aacute;ximo de modo que o limite possa ser estabelecido pela fonte mestra.</p><p><span class="bold"><strong>3 - OPERANDO EM MODO DE CORRENTE-CONSTANTE</strong></span></p><p>Proceda como no par&aacute;grafo 2 para o ajuste da fonte. Neste caso para as fontes operando de modo independente, a corrente ser&aacute; determinada por 10 ou 15 e a tens&atilde;o estabelecida por 12 ou 16 ser&aacute; o 'teto' ou limite de tens&atilde;o. Para a opera&ccedil;&atilde;o sim&eacute;trica proceder conforme item 2.</p><p><span class="bold"><strong>4 - LIGA&Ccedil;&Atilde;O DA CARGA</strong></span></p><p>Ao ligar a carga, assegure-se de que esta utilizando condutores de baixa resist&ecirc;ncia, o mais curtos poss&iacute;vel e de bitola compat&iacute;vel com a corrente ao ser fornecida pela fonte, pois, destes cuidados dependem muito o desempenho do conjunto, principalmente a boa regula&ccedil;&atilde;o e seguran&ccedil;a.</p><p>4.1 - ATERRAMENTO DA FONTE</p><p>&Eacute; fornecido um borne de aterramento 13. que est&aacute; ligado galvanicamente ao chassis, podendo ser deixado flutuante ou ligado a qualquer das sa&iacute;das.</p><p><span class="bold"><strong>5 - UTILIZA&Ccedil;&Atilde;O DO MEDIDOR PARA MEDI&Ccedil;&Otilde;ES EXTERNAS</strong></span></p><p>Uma caracter&iacute;stica extremamente interessante deste aparelho &eacute; a possibilidade que oferece de efetuar medi&ccedil;&otilde;es externas a fonte tanto em partes alimentadas por esta como por qualquer outra.</p><p>No modo externo, o medidor esta totalmente isolado da fonte de alimenta&ccedil;&atilde;o, permitindo efetuar medi&ccedil;&otilde;es com rela&ccedil;&atilde;o a qualquer ponto da mesma, respeitados naturalmente os limites de seguran&ccedil;a especificados.</p><p>Para utiliza-lo neste modo, aperte a tecla INT/EXT 4 para a posi&ccedil;&atilde;o EXT, a entrada do medidor esta nos dois bornes 7 abaixo do teclado.</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="extra_generator_tr-0463.html"><img src="images/prev.gif" alt="Prev"></a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="extra.html"><img src="images/up.gif" alt="Up"></a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="extra_resistors.html"><img src="images/next.gif" alt="Next"></a></td></tr><tr><td width="40%" align="left" valign="top">3.&nbsp;Function Generator TR-0463&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html"><img src="images/home.gif" alt="Home"></a></td><td width="40%" align="right" valign="top">&nbsp;5.&nbsp;Reading Resistors</td></tr></table></div></body></html>