<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>1.&nbsp;Basic Tools (Half1/Half2)</title><link rel="stylesheet" href="html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.67.0"><link rel="start" href="index.html" title="Introduction to Electricity for Computing"><link rel="up" href="individual_assignments.html" title="Chapter&nbsp;3.&nbsp;Individual Assignments - Laboratory"><link rel="prev" href="individual_assignments.html" title="Chapter&nbsp;3.&nbsp;Individual Assignments - Laboratory"><link rel="next" href="individual_assignments_osciloscope.html" title="2.&nbsp;Osciloscope Use (Half1/Half2)"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">1.&nbsp;Basic Tools (Half1/Half2)</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="individual_assignments.html"><img src="images/prev.gif" alt="Prev"></a>&nbsp;</td><th width="60%" align="center">Chapter&nbsp;3.&nbsp;Individual Assignments - Laboratory</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="individual_assignments_osciloscope.html"><img src="images/next.gif" alt="Next"></a></td></tr></table><hr></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="individual_assignments_basic_tools"></a>1.&nbsp;Basic Tools (Half1/Half2)</h2></div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e209"></a>1.1.&nbsp;Objetivos</h3></div></div></div><p>Familiariza&ccedil;&atilde;o com instrumentos de Medi&ccedil;&atilde;o Eletr&ocirc;nicos, Identifica&ccedil;&atilde;o e Medi&ccedil;&atilde;o de Resist&ecirc;ncias e de Protoboards.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e214"></a>1.2.&nbsp;Introdu&ccedil;&atilde;o</h3></div></div></div><p>O objetivo principal desta pr&aacute;tica &eacute; a familiariza&ccedil;&atilde;o com algumas ferramentas b&aacute;sicas que ser&atilde;o utilizadas nas aulas pr&aacute;ticas. Com rela&ccedil;&atilde;o a instrumentos de medida, os mais utilizados (no curso de Eletr&ocirc;nica B&aacute;sica) ser&atilde;o o Mult&iacute;metro, o Gerador de Fun&ccedil;&otilde;es, a Fonte de corrente e tens&atilde;o e oscilosc&oacute;pio. Os primeiros ser&atilde;o vistos nesta aula e o oscilosc&oacute;pio na, pr&oacute;xima pr&aacute;tica.</p><p>O mult&iacute;metro &eacute; um instrumento com m&uacute;ltiplas f un&ccedil;&otilde;es. Nas aulas pr&aacute;ticas ser&aacute; utilizado o mult&iacute;metro digital MIC-2200A que cont&eacute;m as seguintes fun&ccedil;&otilde;es: medi&ccedil;&otilde;es de tens&atilde;o AC e CC (volt&iacute;metro), corrente CC (amper&iacute;metro), resist&ecirc;ncia (ohmimetro) e teste de diodos.</p><p>O gerador de fun&ccedil;&otilde;es fornece tens&atilde;o alternada com diferentes formas, amplitudes e freq&uuml;&ecirc;ncias. O gerador de fun&ccedil;&otilde;es a ser utilizado &eacute; o IT 100K, que fornece ondas senoidais, triangulares e quadradas com frequ&ecirc;ncias entre lHz e 100 KHz.</p><p>A fonte de alimenta&ccedil;&atilde;o que ser&aacute; utilizada no laborat&oacute;rio &eacute; a SME 59 que fornece fontes de corrente e tens&atilde;o. A fonte de tens&atilde;o pode ser utilizada de forma Sim&eacute;trica (+/- 20 V) ou como duas fontes (de 0 a 20 V). A fonte de corrente &eacute; ajust&aacute;vel entre 0 e 2A. Esta fonte oferece ainda um volt&iacute;metro com tr&ecirc;s escalas de tens&atilde;o (2, 20 e 200 V) e um amper&iacute;metro com tr&ecirc;s escalas de corrente (2, 20 e 200 mA), ambos com 3 1/2 d&iacute;gitos.</p><p>Para a montagem dos circuitos ser&aacute; utilizado um protoboard com 550 pontos. Protoboard &eacute; uma placa onde tem-se dispon&iacute;veis v&aacute;rios pontos, alguns interligados e v&aacute;rios independentes.</p><p>A parte pr&aacute;tica desta aula constar&aacute; de medi&ccedil;&otilde;es de correntes, tens&otilde;es e resist&ecirc;ncias. O valor nominal das resist&ecirc;ncias &eacute; obtido atrav&eacute;s de um c&oacute;digo de cores. Este c&oacute;digo indica n&atilde;o s&oacute; o valor como tamb&eacute;m sua toler&acirc;ncia isto &eacute;, o quanto este o valor nominal de cada resist&ecirc;ncia pode variar.</p><p>Os modo de opera&ccedil;&atilde;o dos equipamentos a serem utilizados no laborat&oacute;rio, como utilizar o protoboard e como identificar os valores das resist&ecirc;ncias pelo c&oacute;digo de cores &eacute; descrito em uma apostila que voc&ecirc; encontrar&aacute; no laborat&oacute;rio.</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e231"></a>1.3.&nbsp;Parte Pr&aacute;tica</h3></div></div></div><p><span class="bold"><strong>1. Medi&ccedil;&atilde;o de Resist&ecirc;ncia</strong></span></p><p>1.1 - Identifique um dos resistores fornecidos lendo o seu valor e toler&acirc;ncia atrav&eacute;s do c&oacute;digo de cores.</p><p>1.2 - Utilizando uma escala adequada do mult&iacute;metro, me&ccedil;a o valor da resist&ecirc;ncia. Leia sobre o modo de opera&ccedil;&atilde;o do mult&iacute;metro no material dispon&iacute;vel na Web.</p><p>1.3 - Compare o valor medido com o valor lido levando em considera&ccedil;&atilde;o a toler&acirc;ncia do resistor e a precis&atilde;o do mult&iacute;metro.</p><p><span class="bold"><strong>2. Medi&ccedil;&atilde;o de tens&atilde;o e corrente cont&iacute;nua</strong></span></p><p>2.1 - Ajuste a fonte da esquerda para fornecer uma tens&atilde;o cont&iacute;nua de 10 V (ajuste de corrente no m&aacute;ximo).</p><p>2.2 - Utilizando o protoboard, conecte a fonte ao resistor fornecido, conforme o esquema abaixo:</p><div class="figure"><a name="d0e250"></a><p class="title"><b>Figure&nbsp;3.1.&nbsp;Circuito 1</b></p><div class="mediaobject"><img src="resources/lab1.image1.jpg" alt="Circuito 1"></div></div><p>Observe que o amper&iacute;metro deve ser colocado em s&eacute;rie com a fonte e a resist&ecirc;ncia.</p><p>2.3 - Me&ccedil;a o valor da corrente que circula pelo circuito.</p><p>2.4 - Calcule o valor do resistor R.</p><p>2.5 - Compare com os valores obtidos em 1.1 e 1.2 e conclua.</p><p>2.6 - Desconecte as liga&ccedil;&otilde;es. Retorne a zero os ajustes de tens&atilde;o e corrente da fonte.</p><p>2.7- Monte o circuito abaixo, utilizando a fonte da esquerda:</p><div class="figure"><a name="d0e268"></a><p class="title"><b>Figure&nbsp;3.2.&nbsp;Circuito 2</b></p><div class="mediaobject"><img src="resources/lab1.image2.jpg" alt="Circuito 2"></div></div><p>Observe que o volt&iacute;metro deve ser colocado em paralelo com a resist&ecirc;ncia sobre a qual deseja-se medir a tens&atilde;o.</p><p>2.8 - Ajuste a fonte para fornecer uma corrente continua de l0mA (ajuste de tens&atilde;o no m&aacute;ximo).</p><p>2.9 - Me&ccedil;a o valor da tens&atilde;o sobre o resistor.</p><p>2.10 - Calcule o valor do resistor, compare com os obtidos anteriormente e conclua.</p><p><span class="bold"><strong>3. Medi&ccedil;&atilde;o de tens&atilde;o e corrente</strong></span></p><p>3.1 - Monte o circuito abaixo:</p><div class="figure"><a name="d0e287"></a><p class="title"><b>Figure&nbsp;3.3.&nbsp;Circuito 3</b></p><div class="mediaobject"><img src="resources/lab1.image3.jpg" alt="Circuito 3"></div></div><p>3.2 - Me&ccedil;a a tens&atilde;o sobre os dois resistores e analise os resultados.</p><p>3.3 - Me&ccedil;a a corrente que flui pelo circuito e compare com o resultado obtido em 2.3. Conclua.</p><p><span class="bold"><strong>4. Medi&ccedil;&atilde;o de tens&atilde;o alternada utilizando mult&iacute;metro</strong></span></p><p>4.1 - Conecte o mult&iacute;metro diretamente ao gerador de sinais.</p><p>4.2 - Ajuste o gerador para fornecer uma tens&atilde;o senoidal com 1 KHz e tens&atilde;o pico a pico m&aacute;xima.</p><p>4.3 - Utilizando o manual de opera&ccedil;&atilde;o do mult&iacute;metro obtenha o valor pico a pico da tens&atilde;o gerada. Analise o resultado.</p><p>4 .4 - Ajuste agora o gerador de fun&ccedil;&otilde;es obter uma onda quadrada com mesma amplitude e frequ&ecirc;ncia.</p><p>4.5 - Repita o item 4.3.</p><p><span class="bold"><strong>5. Procedimentos Finais</strong></span></p><p>5.1 - Desligue todos os equipamentos, desconecte os cabos e componentes guardando-os nos recipientes adequados.</p><p>5.2 - Responda as perguntas abaixo:</p><div class="informalexample"><p>- Explique em poucas palavras porque deve-se conectar o mult&iacute;metro em serie parar medir corrente e em paralelo para tens&otilde;es.</p></div><p>5.3 Conclua o relat&oacute;rio</p><p>O relat&oacute;rio deve conter todos os valores medidos ou c&aacute;lculos executados, as analises pedidas, as conclus&otilde;es e respostas a perguntas. Quando julgar necess&aacute;rio ou for requisitado, descrever o procedimento adotado para obten&ccedil;&atilde;o dos resultados. Deixar bem claro a que item do roteiro se refere cada resultado.</p><p><a href="extra.html" title="Chapter&nbsp;4.&nbsp;Extra Material">Extra Material</a></p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="individual_assignments.html"><img src="images/prev.gif" alt="Prev"></a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="individual_assignments.html"><img src="images/up.gif" alt="Up"></a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="individual_assignments_osciloscope.html"><img src="images/next.gif" alt="Next"></a></td></tr><tr><td width="40%" align="left" valign="top">Chapter&nbsp;3.&nbsp;Individual Assignments - Laboratory&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html"><img src="images/home.gif" alt="Home"></a></td><td width="40%" align="right" valign="top">&nbsp;2.&nbsp;Osciloscope Use (Half1/Half2)</td></tr></table></div></body></html>