<html>
<head>
<title>Tutorial Speech Development Kit Java Technology</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#3333FF" onLoad="">
<p align="center"><font color="#FFFFFF" size="4"><b><font size="5">Introdu&ccedil;&atilde;o</font></b></font> 
</p>
<p><font color="#FFFFFF" size="4">A tecnologia <i>Speech Development Kit Java 
  Technology</i> &eacute; um pacote de programa&ccedil;&atilde;o Java, portanto 
  100% orientado a objetos, que se utiliza da tecnologia de reconhecimento e s&iacute;ntese 
  de voz comercializada pela IBM com o nome de ViaVoice. A API &eacute; uma ferramenta 
  que possibilita a constru&ccedil;&atilde;o de interfaces utilizando-se recursos 
  de voz. Qualquer aplica&ccedil;&atilde;o standalone Java (n&atilde;o inclui 
  applets) pode ter sua intera&ccedil;&atilde;o usu&aacute;rio-computador estabelecida 
  com este pacote de software.</font></p>
<p><font color="#FFFFFF" size="4">O reconhecimento e a s&iacute;ntese propriamente 
  ditos n&atilde;o s&atilde;o realizados pelo software Java, refor&ccedil;ando-se 
  que a API &eacute; apenas um meio de se construir interfaces orientadas a voz. 
  As aplica&ccedil;&otilde;es deixam todo o processamento de voz 
  para o software que est&aacute; por tr&aacute;s, o ViaVoice da IBM (vers&atilde;o comercial 
  ou n&atilde;o).</font></p>
<p><font color="#FFFFFF" size="4">Assim como os modelos de programa&ccedil;&atilde;o 
  de interface gr&aacute;fica, o SDK Java tamb&eacute;m &eacute; orientado a
eventos. Diferenciando-se porém a natureza destes eventos, que no caso n&atilde;o s&atilde;o 
  desencadeados por I/O como o mouse ou o teclado, mas sim pela voz humana, que 
  chega ao processamento utilizando-se um microfone e a placa de som.</font></p>
<p><font color="#FFFFFF" size="4"> O processamento gerado pela interface tamb&eacute;m 
  &eacute; distinto, sendo capaz de sintetizar voz e estabelecer a completa comunica&ccedil;&atilde;o 
  verbal com o usuário. Al&eacute;m da s&iacute;ntese de voz, peculiar &agrave; 
  tecnologia, qualquer outro tipo de processamento pode ser desencadeado utilizando-se
essa t&eacute;cnica de software: desde de evolu&ccedil;&otilde;es gr&aacute;ficas 
  a at&eacute; processamento de dados.</font></p>
<p><font color="#FFFFFF" size="4">Como dito anteriormente, o software baseia-se 
  em duas premissas, a s&iacute;ntese e o reconhecimento de voz:</font></p>
<ul>
  <li><font color="#FFFFFF" size="4"> O reconhecimento pode ser realizado com 
    base em gram&aacute;ticas, que podem ser de duas esp&eacute;cies:</font></li>
</ul>
<blockquote> 
  <blockquote> 
    <p><font color="#FFFFFF" size="4">- de ditado: especial para a elocu&ccedil;&atilde;o 
      cont&iacute;nua de discurso, quando o software procura determinar o que 
      est&aacute; sendo falado atrav&eacute;s de uma ampla base de dados de palavras 
      e fonemas inter relacionados. A an&aacute;lise da entrada de som &eacute; 
      realizada procurando-se estabelecer correspond&ecirc;ncia entre as palavras 
      pr&eacute; estabelecidas e o que est&aacute; sendo dito. Para aumentar o 
      acerto de reconhecimento &eacute; feita uma an&aacute;lise autom&aacute;tica 
      do contexto em que as palavras est&atilde;o sendo pronunciadas. Esta base de dados 
      &eacute; simplesmente referenciada como <i>DictationGrammar</i>, sendo poss&iacute;vel 
      utilizar diferentes gram&aacute;ticas desta natureza em fun&ccedil;&atilde;o 
      do dom&iacute;nio que abrangem: como medicina, engenharia, direito, etc.</font></p>
    <p><font color="#FFFFFF" size="4">- de regras: estas gram&aacute;ticas utilizam 
      regras, estas regras s&atilde;o defini&ccedil;&otilde;es estabelecidas pelo 
      desenvolvedor para se limitar o conjunto de poss&iacute;veis eventos sonoros 
      que podem ser disparados pelo usu&aacute;rio. Atrav&eacute;s de um arquivo 
      texto escrito em um formato especial de defini&ccedil;&atilde;o de gram&aacute;ticas, 
      o JSGF, determinam-se exatamente todas as poss&iacute;veis palavras ou frases 
      (regras) que podem ser pronunciadas. A cada uma delas associa-se&nbsp; um evento 
      espec&iacute;fico para ser tratado pelo software. Estas gram&aacute;ticas 
      s&atilde;o definidas pelo programador e s&atilde;o referenciadas como <i>RuleGrammar</i>.</font></p>
  </blockquote>
</blockquote>
<ul>
  <li><font color="#FFFFFF" size="4">A s&iacute;ntese de voz pode ser realizada 
    atrav&eacute;s de simples frases fornecidas como argumentos para a premissa 
    &quot;speak&quot;. Frases diretas s&atilde;o facilmente sintetizadas mas uma 
    maior naturalidade do sintetizador &eacute; conseguida via uma linguagem de 
    marca&ccedil;&atilde;o denominada JSML, concordante com o padr&atilde;o XML. 
    Atrav&eacute;s dela podemos alterar propriedades como o tom de voz, a frequ&ecirc;ncia,
    ritmo e volume.</font></li>
</ul>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
</body>
</html>
